Repository: AhmedEsmail111/xplora
Catalog: lib/l10n/app_*.arb
Languages: ar

# welcome
source: Welcome to
ar: أهلا بك في

# need_info
source: We need some info before you start your journey 🪐
ar: نحتاج فقط إلى ملئ هذه البيانات قبل بدء رحلتك 🪐

source: Name
ar: الإسم

source: Age
ar: العمر

# preferred_language
source: Your Preferred Language
ar: اختر لغتك المفضلة

source: Submit
ar: إرسال

source: Save
ar: تأكيد

# start_journey
source: Start Your Journey🪐
ar: إبدأ رحلتك🪐

# about_app
source: About the App
ar: حول التطبيق

# own_universe
source: The Universe is yours,
ar: الكون ملك يديك يا,

# planets_of
source: Exoplanets of Milky way
ar: الكواكب خارج مجموعتنا الشمسية

# planets
source: Plants
ar: الكواكب

source: Stars
ar: النجوم

source: Description
ar: الوصف

source: Facts about
ar: حفائق عن

# type
source: Exoplanet
ar: كوكب خارج المجموعة الشمسية

# milk_galaxy
source: Milky Way Galaxy
ar: مجرة درب التبانة

# milk_galaxy_info1
source: The Milky Way galaxy is our home galaxy and is classified as a barred spiral galaxy. It has a diameter of about 100,000 to 180,000 light-years and contains billions of stars, as well as numerous planets, gas clouds, and dust. The Milky Way is estimated to have formed around 14 billion years ago, shortly after the Big Bang.
ar: تُعتبر مجرة درب التبانة موطننا وهي مصنفة كمجرة حلزونية مقيدة. يبلغ قطرها حوالي 100,000 إلى 180,000 سنة ضوئية وتحتوي على مليارات النجوم، بالإضافة إلى العديد من الكواكب، والسحب الغازية، والغبار. يُقدّر أن مجرة درب التبانة تشكلت منذ حوالي 14 مليار سنة، بعد فترة وجيزة من الانفجار العظيم.

# milk_galaxy_info2
source: Our solar system is located approximately 26,000 light-years from the galactic center and takes about 240 million years to complete one orbit around it. The Milky Way is characterized by its distinctive bright band of light in the night sky, which is made up of stars from its spiral arms.
ar: يقع نظامنا الشمسي على بُعد حوالي 26,000 سنة ضوئية من مركز المجرة ويستغرق حوالي 240 مليون سنة لإكمال دورة واحدة حوله. تتميز مجرة درب التبانة بشريطها المضيء المميز في سماء الليل، الذي يتكون من نجوم من أذرعها الحلزونية.

# super_jupiter_desc
source: Remarkable exoplanet discovered in August 2020. It is significantly larger than Jupiter, with a mass about 14 times greater. The planet has a scorching temperature of around 1500 Kelvin. What makes TYC 8998-760-1 b particularly interesting to scientists is that it was the first exoplanet to be directly imaged, marking a significant achievement in astronomical research.
ar: كوكب خارج المجموعة الشمسية مذهل تم اكتشافه في أغسطس 2020. إنه أكبر بكثير من كوكب المشتري، حيث تبلغ كتلته حوالي 14 ضعفًا. يتمتع الكوكب بدرجة حرارة حارقة تبلغ حوالي 1500 كلفن. ما يجعل TYC 8998-760-1 b مثيرًا للاهتمام بشكل خاص للعلماء هو أنه كان أول كوكب خارج المجموعة الشمسية يتم تصويره مباشرة، مما يمثل إنجازًا كبيرًا في البحث الفلكي.

# super_jupiter_discovery
source: August 2020
ar: أغسطس 2020

# super_jupiter_size
source: 14 times the mass of Jupiter
ar: 14 مرة كتلة كوكب المشتري

# super_jupiter_temp
source: 1500 Kelvin
ar: 1500 كلفن

# super_jupiter_scien
source: First planet to be directly imaged
ar: أول كوكب يتم تصويره مباشرة

source: NickName
ar: اللقب

# type_in_card
source: Type
ar: النوع

source: Temperature
ar: درجة الحرارة

source: Size
ar: الحجم

source: Scientific Interest
ar: الأهمية العلمي

source: Link
ar: اللينك

# discovery
source: Discovered at
ar: اكتشف في

# crimson_swirl_desc
source: Rocky exoplanet discovered in October 2018. It is larger than Earth and has a surface temperature of about 490 Kelvin. This planet is of great scientific interest as an example of giant Earth-like planets, offering valuable data on rocky planet formation and characteristics beyond our solar system.
ar: هو كوكب صخري تم اكتشافه في أكتوبر 2018. حجمه أكبر من الأرض وتصل درجة حرارته إلى حوالي 490 كلفن. يتميز بأهميته العلمية كأحد الأمثلة على الكواكب العملاقة الشبيهة بالأرض، ويوفر بيانات مهمة عن تشكل الكواكب الصخرية وخصائصها خارج نظامنا الشمسي.

# crimson_swirl_discovery
source: October 2018
ar: أكتوبر 2018

# crimson_swirl_size
source: Rocky planet larger than Earth
ar: كوكب صخري أكبر من الأرض

# crimson_swirl_temp
source: 490 Kelvin
ar: 490 كلفن

# crimson_swirl_scien
source: Example of giant Earth-like planets
ar: مثال على كواكب شبيهة بالأرض العملاقة

# mystic_range_desc
source: Jupiter-sized exoplanet discovered in 2014 with a temperature of approximately 1200 Kelvin. It holds significant scientific interest as the first planet found to have no clouds in its atmosphere, allowing for more detailed studies of its atmospheric composition. This discovery contributes to our understanding of exoplanetary atmospheres and their characteristics
ar: بحجم كوكب المشتري تم اكتشافه في عام 2014 وتبلغ درجة حرارته حوالي 1200 كلفن. يتميز هذا الكوكب بأهمية علمية كبيرة لكونه أول كوكب يُكتشف بدون غيوم في غلافه الجوي، مما يتيح دراسة تفصيلية لتكوين الغلاف الجوي. يُساهم هذا الاكتشاف في فهم خصائص أجواء الكواكب الخارجية

# mystic_range_size
source: Jupiter-sized
ar: بحجم كوكب المشتري

# mystic_range_temp
source: Approximately 1200 Kelvin
ar: 1200 كيلفن تقريبا

# mystic_range_scien
source: First planet without clouds in its atmosphere
ar: أول كوكب بلا سُحب في غلافه الجوي

# inferno_eclipse_desc
source: Jupiter-sized exoplanet discovered in 2006 with a temperature of around 1800 Kelvin. It is one of the darkest known planets, reflecting less than 1% of the light that hits it. This makes it of great scientific interest, offering insights into the composition and properties of its atmosphere and surface.
ar: تبلغ درجة حرارته 1800 كلڨن بحجم مشابه لكوكب المشتري تم اكتشافه في عام 2006 يُعتبر من أظلم الكواكب المعروفة، حيث يعكس أقل من 1% من الضوء الذي يصل إليه. يُثير هذا الكوكب اهتمامًا علميًا كبيرًا لما يقدمه من رؤى حول تركيب غلافه الجوي وخصائص سطحه.

# inferno_eclipse_size
source: Similar in size to Jupiter
ar: مشابه في الحجم لكوكب المشتري

# inferno_eclipse_temp
source: Approximately 1800 Kelvin
ar: حوالي 1800 كلفن

# inferno_eclipse_scien
source: One of the darkest known planets
ar: أحد أظلم الكواكب المعروفة

# nebula_rose_desc
source: an exoplanet discovered in 2004, with a mass about 22 times that of Earth and a temperature of approximately 712 Kelvin. It is of scientific interest for studying thermal effects in exoplanet atmospheres. This planet provides valuable insights into how heat is distributed and retained on planets of its size.
ar: تم اكتشافه في عام 2004، وتبلغ كتلته حوالي 22 ضعف كتلة الأرض ودرجة حرارته حوالي 712 كلفن. يُثير اهتمام العلماء لدراسة التأثيرات الحرارية في أجواء الكواكب الخارجية. يوفر هذا الكوكب رؤى مهمة حول كيفية توزيع واحتفاظ الحرارة على الكواكب ذات الحجم المماثل.

# nebula_rose_size
source: About 22 times the mass of Earth
ar: حوالي 22 مرة كتلة الأرض

# nebula_rose_temp
source: Approximately 712 Kelvin
ar: حوالي 712 كلفن

# nubela_rose_scien
source: Studying thermal effects
ar: دراسة التأثيرات الحرارية

# mystic_blue_desc
source: an exoplanet discovered in 2005, with a mass about 8 times that of Earth and a temperature of approximately 1200 Kelvin. Known as the storm planet, it is of great scientific interest due to its extreme weather conditions, including violent winds and storms. This planet helps scientists study atmospheric dynamics in extreme environments.
ar: تم اكتشافه في عام 2005، وتبلغ كتلته حوالي 8 أضعاف كتلة الأرض ودرجة حرارته حوالي 1200 كلفن. يُعرف باسم كوكب العواصف بسبب ظروفه الجوية القاسية التي تشمل رياحًا وعواصف عنيفة. يُقدم هذا الكوكب رؤى مهمة لدراسة ديناميكيات الغلاف الجوي في البيئات القاسية.

# mystic_blue_size
source: About 8 times the mass of Earth
ar: حوالي 8 مرات كتلة الأرض

# mystic_blue_temp
source: Approximately 1200 Kelvin
ar: حوالي 1200 كلفن

# mystic_blue_scien
source: Considered the storm planet
ar: يسمى ب كوكب العواصف

# kepler_442_dec
source: Kepler-442b is a super-Earth exoplanet discovered in 2015, located about 1,100 light-years away from Earth. It has a size comparable to Earth, with a mass of 2.36 times that of our planet. Kepler-442b orbits a K-type star, which is slightly cooler than our Sun, and completes its orbit in 112.3 days at a distance of 0.409 AU. It is situated in the habitable zone, making it one of the most Earth-like exoplanets discovered to date.
ar: كبلر-442ب هو كوكب خارج المجموعة الشمسية تم اكتشافه في عام 2015، ويبعد حوالي 1100 سنة ضوئية عن الأرض. يمتلك حجماً قريباً من حجم الأرض بكتلة تقدر بـ 2.36 مرة من كتلة الأرض. يدور كبلر-442ب حول نجم من النوع K، وهو أبرد قليلاً من شمسنا، ويكمل مداره في 112.3 يومًا على مسافة 0.409 وحدة فلكية. يقع الكوكب في المنطقة القابلة للسكن، مما يجعله أحد أكثر الكواكب شبهاً بالأرض التي تم اكتشافها حتى الآن.

# kepler_442_size
source: 1.34 times the size of Earth
ar: 1.34 ضعف حجم الأرض

# kepler_442_temp
source: 233 Kelvin
ar: 233 كلفن

# kepler_442_scien
source: Considered one of the most Earth-like planets in the habitable zone
ar: يعتبر من أكثر الكواكب شبيهة بالأرض في المنطقة الصالحة للحياة

# kepler_186_dec
source: Kepler-186f is a super-Earth exoplanet discovered in 2014, located about 500 light-years from Earth. It has a mass of 1.71 times that of Earth and is only 10% larger in size. The planet orbits an M-type star, which is cooler and redder than the Sun, at a distance of 0.432 AU, taking 129.9 days to complete one orbit. It is the first Earth-sized planet found in the habitable zone of its star, and evidence suggests it has a rocky composition.
ar: تم اكتشاف كبلر-186ف في عام 2014 ويبعد حوالي 500 سنة ضوئية عن الأرض. يمتلك كتلة تقدر بـ 1.71 مرة من كتلة الأرض ويبلغ حجمه أكبر بنسبة 10% فقط من كوكبنا. يدور الكوكب حول نجم من النوع M، وهو أكثر برودة واحمراراً من الشمس، على مسافة 0.432 وحدة فلكية، ويستغرق 129.9 يومًا لإكمال مداره. يعد أول كوكب بحجم الأرض يتم اكتشافه في المنطقة الصالحة للسكن بالنسبة لنجم تابع له، وتشير الدلائل إلى أن تكوينه صخري.

# kepler_186_size
source: 1.11 times the size of Earth
ar: 1.11 ضعف حجم الأرض

# kepler_186_temp
source: Estimated to be cooler than Earth
ar: يُقدر أن تكون أقل من الأرض

# kepler_186_scien
source: The first Earth-sized planet discovered in the habitable zone of another star
ar: أول كوكب بحجم الأرض يُكتشف في المنطقة الصالحة للحياة حول نجم آخ

# trappist_1d_dec
source: TRAPPIST-1 is a cool star located about 40 light-years from Earth. Three Earth-sized planets were discovered orbiting it. While these planets are not entirely within the star’s habitable zone, two of them might contain some water and possibly support life. The third planet in the system is thought to have a narrow band of water between its scorching day side and its icy night side.
ar: يعد النجم TRAPPIST-1 كوكباً بارداً ويبعد حوالي 40 سنة ضوئية عن الأرض. تم اكتشاف ثلاثة كواكب بحجم الأرض تدور حوله. وعلى الرغم من أن هذه الكواكب لا تقع بالكامل في المنطقة الصالحة للسكن، إلا أن اثنين منها قد يحتويان على بعض المياه وربما يدعمان الحياة. يُعتقد أن الكوكب الثالث في النظام يحتوي على شريط ضيق من المياه بين جانبه النهاري الحار وجانبه الليلي الجليدي.

# trappist_1d_size
source: 0.77 times the size of Earth
ar: 0.77 ضعف حجم الأرض

# trappist_1d_temp
source: Estimated around 288 Kelvin
ar: يُقدر حوالي 288 كلفن

# trappist_1d_scien
source: Part of the TRAPPIST-1 system, potentially habitable
ar: جزء من نظام trappist_1 ويُحتمل أن يكون صالحًا للحياة

# kepler_22b_1d_dec
source: Kepler-22b, discovered in 2011, is considered one of the most Earth-like exoplanets. It orbits in the habitable zone of a star similar to the Sun, about 600 light-years away. The planet is slightly more than twice the size of Earth and is believed to be a possible ocean world. The average surface temperature is around 72°F, making it potentially suitable for liquid water, a key requirement for life as we know it.
ar: تم اكتشاف كبلر-22ب في عام 2011، ويُعتبر من الكواكب الأكثر شبهاً بالأرض. يدور في المنطقة الصالحة للحياة حول نجم يشبه الشمس ويبعد حوالي 600 سنة ضوئية. يبلغ حجم الكوكب أكثر بقليل من ضعف حجم الأرض، ويُعتقد أنه قد يكون عالماً مائياً. متوسط درجة الحرارة على سطحه حوالي 72 درجة فهرنهايت، مما يجعله مناسباً لوجود المياه السائلة، وهي عنصر أساسي للحياة كما نعرفها

# kepler_22b_1d_size
source: 2.4 times the size of Earth
ar: 2.4 ضعف حجم الأرض

# kepler_22b_1d_temp
source: 295 Kelvin
ar: 295 كيلفن

# kepler_22b_1d_scien
source: First planet found within the habitable zone of a sun-like star
ar: أول كوكب يُكتشف في المنطقة الصالحة للحياة حول نجم شبيه بالشمس

# kepler_452_dec
source: Kepler-452b, discovered in 2015, is considered an Earth-cousin due to its similarities with our planet. It is located about 1,400 light-years away from Earth and orbits a star with the same temperature as our Sun, although the star is 1.5 billion years older. Kepler-452b is situated in the star’s habitable zone, where liquid water could potentially exist, making it a strong candidate for hosting life.
ar: يُعتبر كبلر-452ب، الذي تم اكتشافه في عام 2015، شبيهاً بالأرض نظراً لتشابهه الكبير معها. يبعد حوالي 1400 سنة ضوئية عن الأرض ويدور حول نجم له نفس درجة حرارة شمسنا، لكن هذا النجم أكبر عمراً بحوالي 1.5 مليار سنة. يقع كبلر- 452 ب في المنطقة الصالحة للحياة حول نجمه، مما يجعله مرشحاً قوياً لوجود المياه السائلة وربما الحياة

# kepler_452_size
source: 1.6 times the size of Earth
ar: 1.6 ضعف حجم الأرض

# kepler_452_temp
source: Estimated around 265 Kelvin
ar: يُقدر حوالي 265 كلفن

# kepler_452_scien
source: Known as Earth’s older cousin due to its similarity and age
ar: يُعرف باسم ابن عم الأرض الأكب بسبب تشابهه مع الأرض وعمره
